:PROPERTIES:
:ID: DD527011-4F5E-4716-97A2-6AA8C70F3BB6
:END:
#+title: How do I import the 2016-02-05 ORE reference vintage market data?
#+description: Import the 2016-02-05 ORE reference vintage market data via ores.shell's marketdata import command; currently fails on a known duplicate-key bug.
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:marketdata:
#+created: 2026-07-04
#+updated: 2026-07-04

Reproduce, from the command line, the market data import needed by
[[id:9C428EBD-E6B2-4616-9225-D374C0555904][Import the 2016-02-05 ORE reference vintage]] — the dominant ORE
anchor date, sourced from =Legacy/Example_56=. The =ores-shell= block
below is tangled into the runnable script library as
=import_legacy_example_56.ores=.

*⚠ Currently broken.* Running this command against the full
=market.txt= fails deterministically — confirmed on a freshly
recreated database, not an artefact of a prior partial import — with:

#+begin_example
✗ Failed to import market data: Repository error: Executing INSERT failed: ERROR:  duplicate key value violates unique constraint "_hyper_15_9_chunk_market_observations_observations_current_uniq"
DETAIL:  Key (tenant_id, party_id, series_id, observation_datetime, COALESCE(point_id, ''::text))=(<tenant>, 00000000-0000-0000-0000-000000000000, <series>, 2016-02-05 00:00:00+00, 6M) already exists.
#+end_example

Some distinct quotes in this file's full quote set appear to
decompose to the same =(series_id, point_id)= pair in
=ores.ore.core='s series key registry
(=projects/ores.ore/core/src/market/series_key_registry.cpp=), which
=market_observations='s uniqueness constraint then rejects. Smaller
vintages (see
[[id:438BECB1-0DF8-4350-9ABF-65F232CBB046][How do I import the TA002 IR Swap example market data?]] and
[[id:9BF3F080-6692-4676-884B-D10DF859D096][How do I import the MarketRisk HistSimVar example market data and fixings?]])
import cleanly, so this is specific to this file's quote set, not a
general fixings/import bug. Tracked at
* Answer

The =marketdata import= command
(=projects/ores.shell/src/app/commands/marketdata_commands.cpp=)
sends the file content as a single =import_market_data_request= over
NATS (subject =marketdata.v1.import=), the same request the Qt
=ImportTradeDialog= sends — reusing =import_service= as-is, no
server-side code specific to the shell. This vintage has no
=fixings.txt=, so only =--file= is passed.

Expectations: the services are up (=compass services start=), a
tenant/party is provisioned and logged in (e.g. via the Barclays
provisioning recipe), and =--source= tags every imported
=market_observation= row so it can be queried back out separately
from other imports.

#+name: import-legacy-example-56
#+begin_src ores-shell :exports none
marketdata import --file external/ore/examples/Legacy/Example_56/Input/market.txt --source ore.reference
logout
#+end_src

Run it from a connected, logged-in shell, or load the generated
script. File paths are relative to the repo root — =compass shell -f
<script>= always runs =ores.shell= with the repo root as its working
directory, so no absolute path or project-root environment variable
is needed:

#+begin_src sh :noweb yes :results output :wrap example
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<import-legacy-example-56>>
EOF
#+end_src

#+RESULTS:
#+begin_example
> marketdata import --file external/ore/examples/Legacy/Example_56/Input/market.txt --source ore.reference
Importing market data...
✗ Failed to import market data: Repository error: Executing INSERT failed: ERROR:  duplicate key value violates unique constraint "_hyper_15_9_chunk_market_observations_observations_current_uniq"
DETAIL:  Key (tenant_id, party_id, series_id, observation_datetime, COALESCE(point_id, ''::text))=(<tenant>, 00000000-0000-0000-0000-000000000000, <series>, 2016-02-05 00:00:00+00, 6M) already exists.

✗ Script aborted at line 1: marketdata import --file external/ore/examples/Legacy/Example_56/Input/market.txt --source ore.reference
> logout
✓ Logged out successfully.
#+end_example

Once [[id:C1BE59FA-F9B6-4482-A5C0-868D37D47504][Full market.txt import hits duplicate observation key]] is fixed,
this command's expected shape is a success line similar to the other
two vintages' recipes: =✓ Imported <N> series, <M> observation(s), 0
fixing(s):= (no fixings for this vintage) — update this recipe's
=#+RESULTS:= once that's true.

